app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "image_file_name" = $1, "updated_at" = $2 WHERE "movies"."id" = 2  [["image_file_name", "superman.jpg"], ["updated_at", Sun, 15 Jun 2014 09:20:43 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"