app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "6"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 6]]
---
  	def destroy
		  @reviews = @movie.reviews.find(params[:id])
		  @reviews.destroy

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["comment", "very good."], ["created_at", Sun, 15 Jun 2014 09:22:05 UTC +00:00], ["movie_id", 7], ["name", "Akiro Semtei"], ["stars", 4], ["updated_at", Sun, 15 Jun 2014 09:22:05 UTC +00:00]]
---
	def create
		  @reviews = @movie.reviews.new(review_params)
		  if @reviews.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "1"]]
---
	def edit
  		 @reviews = @movie.reviews.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "2"]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 7  [["comment", "Not perfect but very watchable, indeed."], ["updated_at", Sat, 14 Jun 2014 21:45:26 UTC +00:00]]
---
	def update
		 @reviews = @movie.reviews.find(params[:id])
	 	if @reviews.update(review_params)