app/controllers/users_controller.rb

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = 5  [["password_digest", "$2a$10$kTu3zNXSCoktHZ2ycNzVLO7dNHpmCRQaeJ2RpytNs3hyYir7.Z8y."], ["updated_at", Mon, 16 Jun 2014 08:23:41 UTC +00:00]]
---
  def update
    if @users.update(user_params)

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @users = User.new(user_params)
    if @users.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
---
  def destroy
    @users.destroy